In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [12]:
Player_Salary_CSV = '../../alec-work/output_csv/final_salaries_team_names_1985_to_2015.csv'
player_salary_df = pd.read_csv(Player_Salary_CSV)
#player_salary_df.rename(comlumns = "teamID" : 'Team ID')
#player_salary_df.head()
new_players_df = player_salary_df.rename(columns = {"yearID": 'Year', "teamID":'Team ID', "name" : "Team Name"})
new_players_df.set_index('Year')

     Team ID lgID   playerID    salary             Team Name franchID
Year
1985     ATL   NL  barkele01    870000        Atlanta Braves      ATL
1985     ATL   NL  bedrost01    550000        Atlanta Braves      ATL
1985     ATL   NL  benedbr01    545000        Atlanta Braves      ATL
1985     ATL   NL   campri01    633333        Atlanta Braves      ATL
1985     ATL   NL  ceronri01    625000        Atlanta Braves      ATL
...      ...  ...        ...       ...                   ...      ...
2015     WAS   NL  treinbl01    512800  Washington Nationals      WSN
2015     WAS   NL  ugglada01    507500  Washington Nationals      WSN
2015     WAS   NL  werthja01  21000000  Washington Nationals      WSN
2015     WAS   NL  zimmejo02  16500000  Washington Nationals      WSN
2015     WAS   NL  zimmery01  14000000  Washington Nationals      WSN

[25575 rows x 6 columns]

In [13]:
teams_info = 'Cleaned_Teams_info.csv'
teams_info_df = pd.read_csv(teams_info)
teams_info_df.set_index('Year')

      Unnamed: 0 Team ID             Team Name  Games  Wins  Loses
Year
1985           0     ATL        Atlanta Braves    162    66     96
1985           1     BAL     Baltimore Orioles    161    83     78
1985           2     BOS        Boston Red Sox    163    81     81
1985           3     CAL     California Angels    162    90     72
1985           4     CHA     Chicago White Sox    163    85     77
...          ...     ...                   ...    ...   ...    ...
2015         883     LAN   Los Angeles Dodgers    162    92     70
2015         884     SFN  San Francisco Giants    162    84     78
2015         885     ARI  Arizona Diamondbacks    162    79     83
2015         886     SDN      San Diego Padres    162    74     88
2015         887     COL      Colorado Rockies    162    68     94

[888 rows x 6 columns]

In [14]:
combined_df = teams_info_df.merge(new_players_df, how ='outer')

final_combined_df = combined_df.drop(columns={'franchID', 'Unnamed: 0'})
final_combined_df.head()

   Year Team ID       Team Name  Games  Wins  Loses lgID   playerID  salary
0  1985     ATL  Atlanta Braves    162    66     96   NL  barkele01  870000
1  1985     ATL  Atlanta Braves    162    66     96   NL  bedrost01  550000
2  1985     ATL  Atlanta Braves    162    66     96   NL  benedbr01  545000
3  1985     ATL  Atlanta Braves    162    66     96   NL   campri01  633333
4  1985     ATL  Atlanta Braves    162    66     96   NL  ceronri01  625000

In [15]:
final_combined_df.to_csv('combined_info.csv')

In [16]:
grouped_df = combined_df.groupby('Team ID')
new_df = pd.DataFrame(grouped_df)
new_df.head()

     0                                                  1
0  ANA         Unnamed: 0  Year Team ID       Team Nam...
1  ARI         Unnamed: 0  Year Team ID             Te...
2  ATL         Unnamed: 0  Year Team ID       Team Nam...
3  BAL         Unnamed: 0  Year Team ID          Team ...
4  BOS         Unnamed: 0  Year Team ID       Team Nam...